import { ResponsiveContainer } from 'common/ui';

import '../defaultStyles.scss';

export const Return = () => {
  return (
    <section className='helpful'>
      <ResponsiveContainer>
        <div>
          <center>
            <h1>Возврат товара надлежащего качества</h1>
          </center>
          <h2>Условия возврата</h2>
          <ul>
            <li>
              Товар принимается к возврату только в полной комплектации, со
              всеми упаковками и наклейками, в неношеном/неиспользованном виде
            </li>
          </ul>
          <h2>Причины возврата</h2>
          <ul>
            <li>
              Если указанный товар не подошел по форме, габаритам, фасону,
              расцветке, размеру или комплектации. Оттенок полученного товара
              отличается от оттенка модели с фотографии на сайте.
            </li>
          </ul>
          <h2>Срок возврата</h2>
          <ul>
            <li>
              Срок возврата товара надлежащего качества составляет 7 дней с
              момента получения товара, если иное не было оговорено при продаже
              товара
            </li>
          </ul>
          <h2>Как вернуть товар</h2>
          <ul>
            <li>
              Связаться с менеджером по телефону, по почте или по другим
              каналам.
            </li>
            <li>
              Покупатель может самостоятельно вернуть не подходящий товар по
              адресу оговоренному с менеджером.
            </li>
          </ul>
          <center>
            <h1>Возврат товара ненадлежащего качества</h1>
          </center>
          <h2>Причины возврата</h2>
          <ul>
            <li>Производственный брак товара</li>
          </ul>
          <h2>Срок возврата</h2>
          <ul>
            <li>
              Покупатель может вернуть товар в течении гарантийного срока,
              установленного производителем.
            </li>
            <li>
              Если гарантийный срок производителем не установлен, срок для
              возврата составляет в течении 10 дней.
            </li>
          </ul>
        </div>
      </ResponsiveContainer>
    </section>
  );
};
