/* eslint-disable no-irregular-whitespace */
import { ResponsiveContainer } from 'common/ui';

import '../defaultStyles.scss'

const Sale = () => {
  return (
    <section className='helpful'>
      <ResponsiveContainer>
        <div>
          <center>
            <h1>Правила продажи товаров</h1>
          </center>
          <strong>
            Товары, размещенные на сайте, предназначены для потребителей. Закон
            «О защите прав потребителей»
          </strong>

          <p>
            ЗАКОН КЫРГЫЗСКОЙ РЕСПУБЛИКИ от 10 декабря 1997 года № 90 О защите
            прав потребителей (В редакции Законов КР 20 марта 2002 года № 42, 17
            февраля 2003 года № 37, 18 июля 2008 года № 158,8 декабря 2009 года
            № 307, 13 февраля 2013 года № 15, 30 июля 2013 года № 178,3 августа
            2013 года № 185, 21 января 2015 года № 22, 31 января 2015 года №
            29,21 февраля 2015 года № 38, 2 июля 2015 года № 142, 24 июля 2015
            года № 188, 22 июля 2020 года № 84,18 января 2022 года №4)
          </p>

          <p>
            Настоящий Закон регулирует отношения, возникающие между
            потребителями и изготовителями, исполнителями, продавцами при
            продаже товаров (выполнении работ, оказании услуг), устанавливает
            права потребителей на приобретение товаров (работ, услуг)
            надлежащего качества и безопасных для жизни и здоровья потребителей,
            получение информации о товарах (работах, услугах) и их изготовителях
            (исполнителях, продавцах), просвещение, государственную и
            общественную защиту их интересов, а также определяет механизм
            реализации этих прав.(Абзац 2 утратил силу в соответствии с Законом
            КР от 22 июля 2020 года № 84)(Абзацы 3-14 утратили силу в
            соответствии с Законом КР от 21 февраля 2015 года № 38)(В редакции
            Законов КР от 20 марта 2002 года № 42, 21 февраля 2015 года № 38, 22
            июля 2020 года № 84)Заказ формируется через
            интернет-сайт https://distore.one/
          </p>
          <p>
            Точную информацию о стоимости доставки в Ваш регион Вы можете узнать
            при оформлении заказа. Правила и условия эффективного и безопасного
            использования Товаров указаны на ярлыках или в инструкции по
            эксплуатации Товара. При доставке предоплаченного заказа, заказ
            выдаётся только при предъявлении Покупателем кода для получения
            заказа, отраженного в личном кабинете Покупателя, или QR-кода из
            мобильного приложения Покупателя. При не предъявлении Покупателем
            указанного кода или QR-кода выдача заказа Покупателю не
            осуществляется.{' '}
          </p>
        </div>
      </ResponsiveContainer>
    </section>
  );
};

export default Sale;
