import { ResponsiveContainer } from 'common/ui';

import '../defaultStyles.scss';

export const PrivacyPolicy = () => {
  return (
    <section className='helpful'>
      <ResponsiveContainer>
        <div>
          <center>
            <h1>Политика конфиденциальности</h1>
          </center>
          <p>
            Наш официальный сайт предоставляет Покупателю безвозмездную
            возможность поиска информации о Товарах, ознакомления с товарными
            предложениями Di Store и других Продавцов, возможность получения (в
            т.ч. по результатам поиска) товарных предложений и информации, а
            также иные функциональные возможности. Пользуясь Интернет-магазином,
            Покупатель соглашается с условиями настоящей Публичной оферты.
          </p>
          <p>
            Di Store вправе самостоятельно и без уведомления Покупателя отбирать
            отзывы для публикации, в том числе:Оставлять отзывы о Товарах,
            размещенных на сайте.
          </p>
          <p>
            Вместе с отзывом Покупателя будет опубликовано его имя, указанное им
            в Личном кабинете сайта.
          </p>
          <p>
            Публиковать отзывы, содержание которых не относится к тематике
            работы нашего сайта, осуществлению покупок на ней;
          </p>
          <p>
            Не публиковать отзывы, содержание которых не относится к реальному
            опыту использования соответствующего товара;
          </p>
          <p>
            Не публиковать отзывы, которые содержат ненормативную лексику,
            высказывания оскорбительного характера, в том числе фотографии и
            изображения, недопустимые к публикации с этической точки зрения;
          </p>
          <p>
            Не публиковать отзывы, комментарии, содержащие ссылки на другие
            веб-сайты, персональные данные третьих лиц;
          </p>
          <p>Удалить опубликованный отзыв в любое время;</p>
          <p>
            Самостоятельно определять срок, в течение которого отзывы считаются
            актуальными и на который они публикуются на сайте.
          </p>
          <p>
            Покупатель соглашается, что оставленные им отзывы и поставленные
            оценки могут быть опубликованы и использованы Di Store на сайте
            магазина или на сайтах третьих лиц без дополнительного согласия
            Покупателя. При этом отзывы и приложенные к нему изображения
            публикуются и используются «как есть» с сохранением авторской
            грамматики и пунктуации, под именем Покупателя, указанным в Личном
            кабинете.
          </p>
          <p>
            Покупатель несет ответственность за достоверность сведений,
            содержащихся в оставленных им отзывах.
          </p>
          <h2>Регистрация на сайте</h2>
          <ul>
            <li>
              Оформить Заказ на сайте магазина могут только зарегистрированные
              Покупатели, при этом Покупатель вправе зарегистрироваться на сайте
              только 1(один) раз, т.е. может иметь только один Личный кабинет.
            </li>
            <li>
              При регистрации на сайте, а также при дальнейшем ее использовании,
              Покупатель предоставляет Di Store свои регистрационные данные (в
              том числе, персональные данные), включая, но не ограничиваясь:
              Ф.И.О., номер телефона, адрес электронной почты, адрес места
              нахождения, пол, дату рождения, сведения о параметрах фигуры
              (размере одежды), реквизиты электронных средств платежа (номер,
              срок действия, код CVV/CVC), и т.д.
            </li>
            <li>
              Di Store собирает, записывает, накапливает, сохраняет и вправе
              использовать, передавать (распространение, предоставление,
              доступ), обезличивать, блокировать, удалить данных Покупателя (в
              том числе, персональных данных).
            </li>
            <li>
              Di Store не несет ответственности за точность и правильность
              информации, предоставляемой Покупателем при регистрации.
            </li>
            <li>
              Покупатель, зарегистрировавшийся на сайте получает индивидуальную
              идентификацию путем ввода смс с кодом доступа, направленного на
              указанный в Личном кабинете контактный номер. Индивидуальная
              идентификация Покупателя позволяет избежать несанкционированных
              действий третьих лиц от имени Покупателя и открывает доступ к
              дополнительным сервисам. Передача Покупателем кода доступа третьим
              лицам запрещена.
            </li>
            <li>
              Покупатель несёт ответственность за все возможные негативные
              последствия, в случае передачи кода доступа, а также учетных
              данных Личного кабинета третьим лицам.
            </li>
            <li>
              Комментарии посетителей могут быть проверены с помощью
              автоматической службы обнаружения спама.
            </li>
          </ul>
        </div>
      </ResponsiveContainer>
    </section>
  );
};
