import { ResponsiveContainer } from 'common/ui';

import '../defaultStyles.scss';

export const PublicOffer = () => {
  return (
    <section className='helpful'>
      <ResponsiveContainer>
        <div>
          <center>
            <h1>Публичная оферта</h1>
          </center>
          Публичная оферта <br />
          Договор публичной оферты интернет-магазина Di Store о дистанционной
          продаже товаров. <br />
          Основные термины
          <ul>
            <li>
              Посетитель– физическое лицо, зашедшее на сайт
              <a href='https://distore.one'>https://distore.one</a>,не имея цели
              размещения Заказа.
            </li>
            <li>
              Пользователь– Посетитель сайта, принявший условия данного
              договора-оферты и желающий оформить Заказы в Интернет-магазине
              <a href='https://distore.one'>https://distore.one</a>
            </li>
            <li>
              Покупатель– Пользователь, физическое лицо, разместившее заказ в
              Интернет-магазине distore.oneс целью приобретения какого-либо
              Товара.
            </li>
            <li>
              Акцепт– безоговорочное согласие Покупателя на принятие условий
              настоящего Договора-оферты.
            </li>
            <li>Продавец– ИП</li>
            <li>
              Товар– канцелярские принадлежности и иные товары, сведения о
              наименовании, ассортименте и цене которых представлены на сайте
              Интернет-магазина
              <a href='https://distore.one'>https://distore.one</a>
            </li>
            <li>
              Заказ– электронная заявка Покупателя на приобретение отдельных
              позиций из ассортиментного перечня Товара, оформленная на сайте
              Интернет-магазина
              <a href='https://distore.one'>https://distore.one</a>
            </li>
            <li>
              Интернет-магазин
              <a href='https://distore.one'>https://distore.one</a>– публично
              доступный веб-ресурс, принадлежащий Продавцу и открытый для
              визуального ознакомления, расположенный в глобальной сети Интернет
              по адресу
              <a href='https://distore.one'>https://distore.one</a>, где
              размещена информация об ассортименте Товара, цене, условиях оплаты
              и доставки.
            </li>
            <li>
              Личный Кабинет– закрытый раздел сайта Интернет-магазина,
              предназначенный для управления учетной записью (аккаунтом)
              Покупателя и доступный только пользователям, прошедшим процедуру
              регистрации.
            </li>
            <li>
              История заказов– закрытый раздел сайта Интернет-магазина,
              доступный только зарегистрированным Покупателям, где хранится
              информация по всем Заказам Покупателя.
            </li>
          </ul>
          Общие положения
          <br />
          1.1. Продавец осуществляет продажу Товара через Интернет-магазин Ди
          Стор по адресу <a href='https://distore.one'>https://distore.one</a>
          <br />
          1.2. При заказе Товара через Интернет-магазин Покупатель полностью
          соглашается с изложенными ниже условиями продажи Товаров (далее –
          Условия продажи Товаров). Если Пользователь не согласен с настоящим
          соглашением (далее – Соглашение), он не вправе оформлять заказ.
          <br />
          1.3. Информация, размещенная на сайте интернет-магазина «distore.one»
          (далее – Интернет-магазин), содержит условия предложения покупки
          товара и представляет собой публичную оферту согласно п. 2 ст. 398
          Гражданского кодекса Кыргызской Республики (далее – ГК). Акцептом
          Покупателя является оформление заказа на предложенный товар (ст. 399
          ГК).В своей деятельности Интернет-магазин руководствуется положениями
          ГК, Закона Кыргызской Республики от 05.12.1997. №90 “О защите прав
          потребителей” (далее – Закон №90), “Правилами торговли отдельными
          видами товаров на территории Кыргызской Республики”, утвержденных
          постановлением Правительства Кыргызской Республики от 30.09.2014. №560
          (далее – Правила №560) и иным действующим законодательством Кыргызской
          Республики (далее – закон/законодательство).Настоящие Правила
          (условия) могут быть изменены Интернет-магазином без какого-либо
          специального уведомления, новая редакция Правил (условий) вступает в
          силу с момента ее размещения на сайте Интернет-магазина, если иное не
          предусмотрено новой редакцией Правил (условий), и не распространяется
          на правоотношения между Покупателем и Интернет-магазином, возникшие до
          вступления новой редакции Правил (условий) в силу. Действующая
          редакция Правил (условий) всегда находится на странице по адресу:
          <a href='https://distore.one/public-offer/'>
            https://distore.one/public-offer/
          </a>
          <br />
          1.4. Продавец вправе изменить Соглашение в одностороннем порядке без
          предварительного информирования Пользователя/Покупателя. Измененное
          Соглашение вступает в силу с момента его опубликования на сайте
          Интернет-магазина.
          <br />
          1.5. Соглашение считается заключенным с момента регистрации
          Пользователя на сайте и/или с момента оформления Покупателем Заказа.В
          Заказе должны быть указаны:
          <ul>
            <li>фамилия и имя (для физических лиц);</li>
            <li>
              адрес доставки, контактный номер телефона для связи с Покупателем
              или указанным им лицом;
            </li>
            <li>наименование, количество и цена Товаров.</li>
          </ul>
          Договор розничной купли-продажи признается заключенным с момента
          выдачи Продавцом Покупателю документов, подтверждающих оплату Товаров.
          <br />
          Предмет соглашения
          <br />
          2.1. В соответствии с настоящим Соглашением Покупателю предоставляется
          возможность приобретать Товары, информация о которых представлена в
          каталоге Интернет-магазина.
          <br />
          2.2. Настоящее Соглашение распространяется на все виды Товаров,
          представленных на Сайте, пока предложения с описанием данных Товаров
          имеются в каталоге Интернет-магазина.
          <br />
          Регистрация на сайте
          <br />
          3.1. Регистрация на сайте Интернет-магазина производится по адресу
          <a href='https://distore.one'>https://distore.one/my-account/</a>
          <br />
          3.2. Регистрация выполняется по желанию Покупателя.
          <br />
          3.3. При регистрации Покупателем должна быть указана следующая
          информация о себе:
          <ul>
            <li>Имя;</li>
            <li>Фамилия (по желанию);</li>
            <li>адрес электронной почты (далее используемый как логин);</li>
            <li>
              пароль для входа в Личный кабинет (длиной не менее 6 символов,
            </li>
            <li>содержащий латинские буквы, цифры и символы);</li>
            <li>номер контактного телефона;</li>
            <li>тип учетной записи (физическое лицо или юридическое лицо).</li>
          </ul>
          Покупатель вправе редактировать регистрационную информацию в Личном
          кабинете.
          <br />
          3.4. Продавец не несет ответственности за достоверность информации,
          указанной Пользователем при регистрации.
          <br />
          Порядок оформления заказа
          <br />
          4.1. Реальный вид Товара может отличаться от фотографий, размещенных
          на сайте. Сопровождающие каждую фотографию текстовое описание и
          характеристики Товара не претендуют на исчерпывающее предоставление
          всего объема сведений о Товаре. При появлении вопросов относительно
          свойств и характеристик Товара Покупатель должен обратиться за
          консультацией к специалисту либо заказать звонок для связи с
          оператором.
          <br />
          4.2. Оформление Заказа осуществляется в следующем порядке:
          <ul>
            <li>зайти в каталог для поиска нужного Товара;</li>
            <li>выбранный Товар добавить в корзину;</li>
            <li>
              по завершении выбора товаров перейти в раздел «Моя корзина»;
            </li>
            <li>
              выбрать способ оплаты заказа (наличный расчет, безналичный расчет,
              оплата пластиковой картой);
            </li>
            <li>указать адрес доставки;</li>
            <li>Нажать кнопку «Подтвердить заказ».</li>
          </ul>
          4.3. Если по результатам обработки Заказа выясняется, что у Продавца
          отсутствует требуемая модель или нужное количество заказанного Товара,
          Продавец уведомляет об этом Покупателя путем звонка на номер
          мобильного телефона либо направляя сообщение по адресу электронной
          почты, указанных Покупателем при регистрации. Покупатель может
          согласиться на исключение указанного Товара из Заказа либо замену
          Товара аналогом либо аннулировать Заказ.
          <br />
          4.4. При аннуляции частично либо полностью оплаченного Заказа Продавец
          возвращает Покупателю стоимость аннулированного Товар.
          <br />
          4.5. Продавец имеет право отказать Покупателю в исполнении Заказа,
          если ранее Покупатель отказался принять переданный ему товар либо
          возвращал товар 5 или более раз с указанием причин, не связанных с
          наличием дефектов в этих товарах.
          <br />
          Доставка Товара
          <br />
          5.1. Конкретные сроки исполнения Заказа оговариваются с Покупателем
          сразу после оформления Заказа на сайте Интернет-магазина. Менеджер,
          обслуживающий этот заказ, уточняет его нюансы и согласовывает дату
          доставки.
          <br />
          5.2. Доставка Товара, заказанного у Продавца, производится несколькими
          способами:
          <ul>
            <li>курьер по городу;</li>
            <li>транспортно-экспедиторская компания в регионы.</li>
          </ul>
          5.3. Расходы по доставке Товара оплачиваются Покупателем. Стоимость
          доставки рассчитывается в соответствии с тарифами Интернет-магазина,
          приведенной на Сайте в разделе «Доставка».Доставка Товара посредством
          почтового отправления или с помощью услуг транспортно-экспедиторской
          компании оплачивается в соответствии с тарифами, установленными
          оператором почтовой связи или данной транспортно-экспедиторской
          компанией. При любом способе доставки транспортные расходы
          выставляются Покупателю в счете на оплату.
          <br />
          5.4. Если Заказ не был исполнен по вине Покупателя (например, в
          результате отсутствия последнего в оговоренное время по месту доставки
          Товара), Продавец имеет право требовать полной оплаты услуг по
          доставке, если расстояние предусматривает оплату. Повторный вызов
          сотрудника Интернет-магазина в целях доставки также оплачивает
          Покупатель.
          <br />
          5.5. Продавец не несет ответственности за ненадлежащее исполнение
          Заказа в случае, если Покупатель предоставил неточную информацию об
          его контактных данных либо составе Заказа.
          <br />
          5.6. Доставка осуществляется в сроки, указанные на Сайте в разделе
          «Доставка».
          <br />
          5.7. Задержки в доставке возможны в связи с действием чрезвычайных и
          непредотвратимых обстоятельств (погодные условия, дорожные пробки, ДТП
          и т.п.).
          <br />
          5.8. При доставке Товар передается Покупателю либо третьему лицу,
          указанному при оформлении Заказа в качестве получателя (далее в
          отношении Покупателя и третьего лица используется термин
          «Получатель»). Если вышеуказанные лица не могут получить Товар,
          оплачиваемый наличными средствами, тот может быть передан лицу,
          способному предоставить сведения о Заказе (ФИО Получателя и/или номер
          отправления) и полностью оплатить стоимость Заказа сотруднику службы
          доставки Продавца.
          <br />
          5.9. Во избежание возможного мошенничества при передаче Товара
          сотрудник службы доставки Интернет-магазина имеет право затребовать
          предъявление доверенности, оформленной Продавцом на имя Получателя, и
          документа, удостоверяющего личность Получателя, а также указать тип и
          номер этого документа в накладной. Если Покупателем Товара выступает
          юридическое лицо, Получатель обязан поставить на накладной либо акте
          выполненных работ оттиск печати организации и в случае оплаты
          безналичным платежом, передать оригинал доверенности.
          Конфиденциальность и защита персональных данных Получателя
          гарантируются Продавцом.
          <br />
          5.10. Товар переходит в собственность Покупателя в момент вручения
          Товара и оплаты последним стоимости Товара в полном объеме, если иное
          не оговорено в договоре поставки Товара.
          <br />
          5.11. При доставке Товара сотрудник службы доставки или
          транспортно-экспедиторской компании передает Покупателю все
          необходимые документы (товарный и кассовый чек при покупке за наличный
          расчет, накладная – при безналичной оплате).
          <br />
          5.12. При принятии Товара от сотрудника службы доставки Продавца или
          транспортно-экспедиторской компании, в обязанность Получателю
          вменяется проверка целостности упаковки, а после ее вскрытия – осмотр
          доставленного Товара и проверка его на соответствие заявленному
          ассортименту, качеству и комплектности. При отсутствии претензий к
          доставленному Товару Получатель ставит свою подпись в квитанции
          доставки и оплачивает Заказ (если оплата производится по наличному
          расчету). Подпись Получателя в доставочном документе означает, что
          Получатель подтверждает полное и надлежащее выполнение Продавцом своей
          обязанности по доставке Товара. При доставке товара
          транспортно-экспедиторской компании Покупателю – юридическому лицу,
          Покупатель обязан за свой счет отправить оригиналы документов
          принадлежащие Продавцу на юридический адрес Продавцу в течении 2-х
          рабочих дней.
          <br />
          Возврат Товара и денежных средств
          <br />
          6.1. Если у Получателя имеются претензии к доставленному Товару
          (недовложение, производственный брак, вложение товара, отличного от
          перечисленного в описи отправления), по указанию Получателя сотрудник
          службы доставки или представитель транспортно-экспедиторской компании
          составляют Акт о выявленных несоответствиях. Последний подписывается
          Получателем и сотрудником службы доставки/представителем
          транспортно-экспедиторской компании.
          <br />
          6.2. В случае возврата Товара в связи с наличием претензий к его
          ассортименту, качеству или комплектности Получатель должен приложить к
          возвращаемому Товару следующие документы:
          <ul>
            <li>копия Акта о выявленных несоответствиях;</li>
            <li>копия описи отправления;</li>
            <li>бланк возврата;</li>
          </ul>
          копия квитанции об оплате и заявление на возврат денежных средств
          (если была произведена предоплата).
          <br />
          6.3. Требование о возврате стоимости оплаченного товара
          удовлетворяется в течение 10 рабочих дней со дня подачи
          соответствующего заявления. Денежные средства возвращаются Покупателю
          тем способом, который указан в заявлении на возврат денежных средств
          (наличными, на банковскую карту, почтовым переводом). Оплата товара
          <br />
          7.1. Способы оплаты Товара перечислены на сайте Интернет-магазина в
          разделе «Способы оплаты». Оплата исполненного заказа может
          осуществляться:
          <br />
          по безналичному расчету через банк путем зачисления денежных средств
          на расчетный счет;
          <br />
          по наличному расчету с передачей денежных средств сотруднику службы
          доставки в момент получения Заказа
          <br />
          через сервис FREEDOM PAY
          <br />
          7.2. Все расчеты между Продавцом и Покупателем производятся в сом.
          <br />
          7.3. Цена на каждую позицию Товара указывается в сом Кыргызской
          Республикина сайте Интернет-магазина.
          <br />
          7.4. Продавец оставляет за собой право в одностороннем порядке
          изменять цены на любые позиции Товара, отображенные на сайте
          Интернет-магазина, без уведомления Покупателя. При этом цена на Товар,
          заказанный Покупателем, изменению не подлежит.
          <br />
          7.5.Продавец имеет право устанавливать программу бонусов, проводить
          акции и вручать подарки. Виды бонусов, акций и подарков, порядок и
          условия их начисления/проведения/вручения перечислены на сайте
          Интернет-магазина и могут изменяться Продавцом в одностороннем
          порядке.
          <br />
          Права, обязанности и ответственность сторон
          <br />
          8.1. Продавец имеет право делегировать свои права и обязанности по
          исполнению заказов специально нанятым сторонним лицам.
          <br />
          8.2. Продавец не несет ответственности за любой ущерб, причиненный
          Покупателю в результате ненадлежащего использования Товаров,
          заказанных на сайте Интернет-магазина.
          <br />
          8.3. За неисполнение и/или ненадлежащее исполнение обязательств по
          настоящему Соглашению Стороны несут ответственность согласно
          действующему законодательству Кыргызской Республики.
          <br />
          Конфиденциальность и защита информации
          <br />
          9.1. Обработка персональных данных Пользователя/Покупателя
          производится в соответствии с Законом КР «О персональных данных и их
          защите» –{' '}
          <a href='http://cbd.minjust.gov.kg/act/view/ru-ru/202269'>
            http://cbd.minjust.gov.kg/act/view/ru-ru/202269
          </a>
          .<br />
          9.2. Покупатель обязуется хранить в тайне логин и пароль для входа в
          Личный кабинет, указанные им при регистрации. При возникновении у
          Покупателя подозрений относительно безопасности данных его учетной
          записи или возможности их несанкционированного использования
          посторонними лицами, Покупатель обязуется немедленно сменить ранее
          указанный пароль на новый.
          <br />
          9.3. Регистрируясь на Сайте, Пользователь/Покупатель соглашается на
          обработку своих персональных данных Продавцом и на передачу
          персональных данных сторонним лицам, привлеченных Продавцом для
          исполнения обязательств по заказу.
          <br />
          9.4. Продавец использует персональные данные Пользователя/Покупателя:
          <ul>
            <li>для регистрации Пользователя на Сайте;</li>
            <li>для исполнения своих обязательств перед Покупателем;</li>
            <li>для анализа и оценки работы Сайта;</li>
            <li>для определения победителя в акциях, проводимых Продавцом (если
          таковые проводятся).</li>
          </ul>
          9.4.1. Продавец вправе отправлять информационные (включая рекламные)
          сообщения на мобильный телефон и электронную почту Покупателя с
          согласия последнего. Покупатель имеет право отказаться от получения
          рекламно-информационной рассылки, не объясняя причин отказа. Сервисные
          сообщения с информацией о Заказе и этапах его обработки отправляются
          автоматически и не могут быть отклонены Покупателем.
          <br />
          9.5. Продавец имеет право использовать технологию «cookies», не
          содержащую конфиденциальную информацию.
          Посетитель/Пользователь/Покупатель соглашается на сбор, анализ и
          использование «cookies», в том числе третьими лицами, для формирования
          статистики и оптимизации рекламной рассылки.
          <br />
          9.6. Продавец не несет ответственности за информацию, предоставленную
          Пользователем/Покупателем на Сайте в общедоступной форме.
          <br />
          Дополнительные условия
          <br />
          10.1. Интернет-магазин может быть временно недоступен, частично или
          полностью, в связи с проведением профилактических или иных работ, а
          также по другим техническим причинам.
          <br />
          10.2. Отношения между Пользователем/Покупателем и Продавцом
          регулируются законодательством Кыргызской Республики.
          <br />
          10.3. Если у Пользователя/Покупателя возникли вопросы или претензии к
          Продавцу, он должен обратиться к последнему, используя контактные
          данные, указанные на сайте. Стороны обязуются предпринимать
          необходимые меры для решения возникающих вопросов путем переговоров.
          Если в ходе переговоров соглашение между сторонами так и не будет
          достигнуто, спор будет рассматриваться в судебном порядке в
          соответствии с установленным законодательством.
          <br />
          10.4. По вопросам, не затронутым в настоящем Соглашении, стороны
          руководствуются действующим законодательством Кыргызской Республики.
          <br />
          Срок действия
          <br />
          11.1. Настоящее Соглашение признается действительным с момента
          регистрации Пользователя на сайте Интернет-Магазина либо обращения к
          Продавцу для оформления Заказа.
          <br />
          11.2. За момент обращения принимается момент, когда Покупатель
          фактически приступил к совершению действий, направленных на
          приобретение Товара у Продавца.
          <br />
        </div>
      </ResponsiveContainer>
    </section>
  );
};
