import { ResponsiveContainer } from 'common/ui';

import "../defaultStyles.scss"

export const Offer = () => {
  return (
    <section className='helpful'>
      <ResponsiveContainer>
        <div>
          <center>
            <h1>Правила оформления заказов</h1>
          </center>
          <p>
            Официальный сайт «Di Store » предназначен для реализации Товаров “Di
            Store” и иных Продавцов, а также услуг «Di Store» по доставке
            указанных Товаров Покупателям.
          </p>
          <p>
            Заказывая на сайте, Покупатель вступает в договорные отношения с «Di
            Store» в рамках договора купли-продажи Товара.
          </p>
          <p>
            Заказывая на нашем сайте Товар, реализуемый иными Продавцами,
            Покупатель в рамках договора купли-продажи вступает в договорные
            отношения непосредственно с Продавцом, реализующим данный Товар.
            Доставка Товара, а также прием оплаты от Покупателей за Товар,
            приобретаемый на сайте осуществляется «Di Store»
          </p>
          <p>
            Взаиморасчеты с Покупателем за Товар, приобретенный им на сайте,
            осуществляется «Di Store» от своего имени или по поручению
            непосредственного Продавца от имени последнего.
          </p>
          <p>
            Покупатель может ознакомиться с информацией о продавце товара при
            оформлении Заказа.
          </p>
          <p>
            Доставка любого Товара, приобретаемого Покупателем посредством
            интернет-магазина, осуществляется «Di Store»До момента совершения
            Заказа Покупатель обязуется ознакомиться со всеми условиями оказания
            Услуг «Di Store», а также приобретения Товаров на сайте. При этом
            очевидные ошибки, включая опечатки, допущенные в описании Товара
            либо в описании Услуги, юридически обязывающими не являются.
          </p>
          <p>
            Оформление Заказа на сайте означает согласие Покупателя со всеми
            существенными условиями оказания «Di Store» услуг доставки Товаров,
            а также настоящими Правилами.
          </p>
          <p>
            Существенные условия заключаемого Покупателем договора купли-продажи
            Товара, а также договора на оказание услуг доставки указываются в
            опубликованном на сайте описании Товара, предоставленного в форме
            оформления Заказа, а также в настоящих Правилах.
          </p>
          <p>
            Осуществляя Заказ, Покупатель соглашается с тем, что «Di Store»
            может поручить исполнение договора третьему лицу, оставаясь
            ответственным за его исполнение перед Покупателем.
          </p>
          <p>Покупатель подтверждает свое согласие с тем, что:</p>

          <ul>
            <li>
              регистрационные данные (в том числе персональные данные) указаны
              им добровольно;
            </li>

            <li>
              регистрационные данные (в том числе персональные данные)
              передаются в электронной форме по открытым каналам связи сети
              «Интернет»;
            </li>

            <li>
              регистрационные данные (в том числе персональные данные) переданы
              «Di Store» для реализации целей, указанных в настоящей Публичной
              оферте и в этих же целях могут быть переданы третьим лицам;
            </li>

            <li>
              регистрационные данные (в том числе персональные данные) могут
              быть использованы «Di Store» в целях продвижения товаров и услуг,
              путем осуществления прямых контактов с Покупателем с помощью
              каналов связи;
            </li>
          </ul>

          <p>Осуществляя Заказ, Покупатель подтверждает, что:</p>

          <ul>
            <li>полностью ознакомился с положениями настоящей Правил;</li>

            <li>
              полностью понимает настоящие Правила, а также предмет и условия
              заключаемого с «Di Store» договора на оказание услуг доставки
              Товаров, а также договора купли-продажи Товаров с «Di Store» или
              иным Продавцом посредством сайта;
            </li>

            <li>
              полностью понимает значение и последствия своих действий в
              отношении заключения и исполнения заключенного с «Di Store»
              договора на оказание услуг доставки Товаров, а также договора
              купли-продажи Товаров с «Di Store» или иным Продавцом посредством
              сайта.
            </li>
          </ul>

          <p>
            Оформляя заказ на сайте «Di Store», Покупатель соглашается на
            получение: (а) электронных писем/push-уведомлений, которые «Di
            Store» может направить Покупателю; (б) сообщений (SMS) на телефонный
            номер, указанный Покупателем, а также (в) звонка с предложением
            оценить качество работы интернет-магазина на телефонный номер,
            указанный Пользователем.
          </p>
          <p>
            «Di Store» вправе заблокировать для Покупателя возможность
            осуществления Заказа в случае неоднократной отмены осуществленных
            Покупателем Заказов, а также в случае нарушения Покупателем
            настоящих Правил.Технически сложные товары бытового назначения, на
            которые установлены гарантийные сроки и размещённые на сайте
            магазина, не предназначены для продажи дистанционным способом. При
            получении технически сложного товара бытового назначения, покупатель
            имеет право в присутствии представителя «Di Store» вскрыть упаковку
            и проверить комплектность товара, наличие относящихся к нему
            технических и (или) эксплуатационных документов. Возможность
            предоставления услуги сайтом «Di Store» по сборке и (или) установке
            (подключении) на дому у потребителя технически сложного товара
            бытового назначения, самостоятельная сборка и (или) подключение
            которого потребителем в соответствии с обязательными требованиями,
            изложенными в технических и (или) эксплуатационных документах,
            прилагаемых к товару, не допускается, отсутствует.
          </p>
        </div>
      </ResponsiveContainer>
    </section>
  );
};
